#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=1b64caca607e392bc85ff27243e6022401cc3184][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_factory.data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.key_vault_ingestion.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault_consumption.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault_ingestion.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault_consumption.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_factory.data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_web_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azapi_resource.subnet_private_endpoints[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_private_endpoints" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.3.2.0/26"
              [32m+[0m[0m delegations                       = []
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "PrivateEndpointSubnetBot"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azapi_resource.subnet_web_app[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_web_app" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.3.1.192/26"
              [32m+[0m[0m delegations                       = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name       = "WebAppDelegation"
                      [32m+[0m[0m properties = {
                          [32m+[0m[0m serviceName = "Microsoft.Web/serverfarms"
                        }
                    },
                ]
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "WebAppSubnetBot"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azurerm_bot_connection.bot_connection_aadv2_oauth[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bot_connection" "bot_connection_aadv2_oauth" {
      [32m+[0m[0m bot_name              = "bfr-dev-bot001"
      [32m+[0m[0m client_id             = (sensitive value)
      [32m+[0m[0m client_secret         = (sensitive value)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m location              = "global"
      [32m+[0m[0m name                  = "aadv2-oauth"
      [32m+[0m[0m parameters            = {
          [32m+[0m[0m "tenantId" = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
        }
      [32m+[0m[0m resource_group_name   = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m scopes                = "openid profile User.Read User.ReadBasic.All"
      [32m+[0m[0m service_provider_name = "Aadv2"
    }

[1m  # azurerm_cognitive_deployment.cognitive_deployment_gpt_4o[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cognitive_deployment" "cognitive_deployment_gpt_4o" {
      [32m+[0m[0m cognitive_account_id   = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m name                   = "gpt-4o"
      [32m+[0m[0m version_upgrade_option = "OnceNewDefaultVersionAvailable"

      [32m+[0m[0m model {
          [32m+[0m[0m format  = "OpenAI"
          [32m+[0m[0m name    = "gpt-4o"
          [32m+[0m[0m version = "2024-08-06"
        }

      [32m+[0m[0m sku {
          [32m+[0m[0m capacity = 75
          [32m+[0m[0m name     = "Standard"
        }
    }

[1m  # azurerm_cosmosdb_sql_database.cosmosdb_sql_database[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cosmosdb_sql_database" "cosmosdb_sql_database" {
      [32m+[0m[0m account_name        = "bfr-dev-cosmos001"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "BotDb"
      [32m+[0m[0m resource_group_name = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m throughput          = (known after apply)

      [32m+[0m[0m autoscale_settings {
          [32m+[0m[0m max_throughput = 1000
        }
    }

[1m  # azurerm_linux_web_app.linux_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_linux_web_app" "linux_web_app" {
      [32m+[0m[0m app_settings                                   = (known after apply)
      [32m+[0m[0m client_affinity_enabled                        = false
      [32m+[0m[0m client_certificate_enabled                     = false
      [32m+[0m[0m client_certificate_mode                        = "Required"
      [32m+[0m[0m custom_domain_verification_id                  = (sensitive value)
      [32m+[0m[0m default_hostname                               = (known after apply)
      [32m+[0m[0m enabled                                        = true
      [32m+[0m[0m ftp_publish_basic_authentication_enabled       = false
      [32m+[0m[0m hosting_environment_id                         = (known after apply)
      [32m+[0m[0m https_only                                     = true
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m key_vault_reference_identity_id                = (known after apply)
      [32m+[0m[0m kind                                           = (known after apply)
      [32m+[0m[0m location                                       = "northeurope"
      [32m+[0m[0m name                                           = "bfr-dev-app001"
      [32m+[0m[0m outbound_ip_address_list                       = (known after apply)
      [32m+[0m[0m outbound_ip_addresses                          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_address_list              = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses                 = (known after apply)
      [32m+[0m[0m public_network_access_enabled                  = true
      [32m+[0m[0m resource_group_name                            = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m service_plan_id                                = (known after apply)
      [32m+[0m[0m site_credential                                = (sensitive value)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m virtual_network_subnet_id                      = (known after apply)
      [32m+[0m[0m webdeploy_publish_basic_authentication_enabled = false
      [32m+[0m[0m zip_deploy_file                                = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = (known after apply)
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "UserAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                               = true
          [32m+[0m[0m app_command_line                        = "gunicorn --bind 0.0.0.0 --worker-class aiohttp.worker.GunicornWebWorker --timeout 600 app:APP"
          [32m+[0m[0m container_registry_use_managed_identity = false
          [32m+[0m[0m default_documents                       = (known after apply)
          [32m+[0m[0m detailed_error_logging_enabled          = (known after apply)
          [32m+[0m[0m ftps_state                              = "Disabled"
          [32m+[0m[0m http2_enabled                           = true
          [32m+[0m[0m ip_restriction_default_action           = "Allow"
          [32m+[0m[0m linux_fx_version                        = (known after apply)
          [32m+[0m[0m load_balancing_mode                     = "LeastRequests"
          [32m+[0m[0m local_mysql_enabled                     = false
          [32m+[0m[0m managed_pipeline_mode                   = "Integrated"
          [32m+[0m[0m minimum_tls_version                     = "1.2"
          [32m+[0m[0m remote_debugging_enabled                = false
          [32m+[0m[0m remote_debugging_version                = "VS2022"
          [32m+[0m[0m scm_ip_restriction_default_action       = "Allow"
          [32m+[0m[0m scm_minimum_tls_version                 = "1.2"
          [32m+[0m[0m scm_type                                = (known after apply)
          [32m+[0m[0m scm_use_main_ip_restriction             = false
          [32m+[0m[0m use_32_bit_worker                       = false
          [32m+[0m[0m vnet_route_all_enabled                  = true
          [32m+[0m[0m websockets_enabled                      = false
          [32m+[0m[0m worker_count                            = 1

          [32m+[0m[0m application_stack {
              [32m+[0m[0m python_version = "3.11"
            }

          [32m+[0m[0m cors {
              [32m+[0m[0m allowed_origins     = [
                  [32m+[0m[0m "https://botservice.hosting.portal.azure.net",
                  [32m+[0m[0m "https://hosting.onecloud.azure-test.net",
                ]
              [32m+[0m[0m support_credentials = true
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_web_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # azurerm_private_endpoint.linux_web_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "linux_web_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-app001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-app001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-app001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-app001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_resource_group.resource_group_consumption[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_consumption" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
    }

[1m  # azurerm_resource_group.resource_group_ingestion[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_ingestion" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
    }

[1m  # azurerm_resource_group.resource_group_monitoring[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_monitoring" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "bfr-dev-bot-mntrng-rg"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
    }

[1m  # azurerm_role_assignment.data_factory_roleassignment_key_vault_secrets_user[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "data_factory_roleassignment_key_vault_secrets_user" {
      [32m+[0m[0m description                      = "Required for accessing secrets in the key vault from the data factory."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.data_factory_roleassignment_storage_blob_data_owner[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "data_factory_roleassignment_storage_blob_data_owner" {
      [32m+[0m[0m description                      = "Required for reding and writing data from data factory."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_cnsm_roleassignment_key_vault_secrets_user[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_cnsm_roleassignment_key_vault_secrets_user" {
      [32m+[0m[0m description                      = "Required for accessing secrets in the key vault from teh web app app settings."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_cnsm_roleassignment_open_ai_contributor[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_cnsm_roleassignment_open_ai_contributor" {
      [32m+[0m[0m description                      = "Required for accessing azure open ai from the web app."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services OpenAI Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_ngst_roleassignment_key_vault_secrets_officer[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_ngst_roleassignment_key_vault_secrets_officer" {
      [32m+[0m[0m description                      = "Required for reading and writing secrets in the key vault from the function."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets Officer"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_ngst_roleassignment_open_ai_contributor[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_ngst_roleassignment_open_ai_contributor" {
      [32m+[0m[0m description                      = "Required for accessing azure open ai from the function."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services OpenAI Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_ngst_roleassignment_storage_blob_data_owner[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_ngst_roleassignment_storage_blob_data_owner" {
      [32m+[0m[0m description                      = "Required for reding and writing data from the function."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.app_service_plan_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.app_service_plan_consumption.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.app_service_plan_consumption.azurerm_service_plan.service_plan[0m will be created
[0m  [32m+[0m[0m resource "azurerm_service_plan" "service_plan" {
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m kind                         = (known after apply)
      [32m+[0m[0m location                     = "northeurope"
      [32m+[0m[0m maximum_elastic_worker_count = (known after apply)
      [32m+[0m[0m name                         = "bfr-dev-asp001"
      [32m+[0m[0m os_type                      = "Linux"
      [32m+[0m[0m per_site_scaling_enabled     = false
      [32m+[0m[0m reserved                     = (known after apply)
      [32m+[0m[0m resource_group_name          = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m sku_name                     = "P0v3"
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m worker_count                 = 1
      [32m+[0m[0m zone_balancing_enabled       = false
    }

[1m  # module.app_service_plan_ingestion.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.app_service_plan_ingestion.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.app_service_plan_ingestion.azurerm_service_plan.service_plan[0m will be created
[0m  [32m+[0m[0m resource "azurerm_service_plan" "service_plan" {
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m kind                         = (known after apply)
      [32m+[0m[0m location                     = "northeurope"
      [32m+[0m[0m maximum_elastic_worker_count = (known after apply)
      [32m+[0m[0m name                         = "bfr-dev-ngst-asp001"
      [32m+[0m[0m os_type                      = "Linux"
      [32m+[0m[0m per_site_scaling_enabled     = false
      [32m+[0m[0m reserved                     = (known after apply)
      [32m+[0m[0m resource_group_name          = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m sku_name                     = "FC1"
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m worker_count                 = 1
      [32m+[0m[0m zone_balancing_enabled       = false
    }

[1m  # module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_application_insights" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.application_insights.azurerm_application_insights.application_insights[0m will be created
[0m  [32m+[0m[0m resource "azurerm_application_insights" "application_insights" {
      [32m+[0m[0m app_id                                = (known after apply)
      [32m+[0m[0m application_type                      = "web"
      [32m+[0m[0m connection_string                     = (sensitive value)
      [32m+[0m[0m daily_data_cap_in_gb                  = 100
      [32m+[0m[0m daily_data_cap_notifications_disabled = false
      [32m+[0m[0m disable_ip_masking                    = false
      [32m+[0m[0m force_customer_storage_for_profiler   = false
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m instrumentation_key                   = (sensitive value)
      [32m+[0m[0m internet_ingestion_enabled            = true
      [32m+[0m[0m internet_query_enabled                = true
      [32m+[0m[0m local_authentication_disabled         = false
      [32m+[0m[0m location                              = "northeurope"
      [32m+[0m[0m name                                  = "bfr-dev-appi001"
      [32m+[0m[0m resource_group_name                   = "bfr-dev-bot-mntrng-rg"
      [32m+[0m[0m retention_in_days                     = 90
      [32m+[0m[0m sampling_percentage                   = 100
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m workspace_id                          = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
    }

[1m  # module.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.azure_open_ai.azurerm_cognitive_account.cognitive_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
      [32m+[0m[0m custom_subdomain_name              = "bfr-dev-aoai001"
      [32m+[0m[0m dynamic_throttling_enabled         = false
      [32m+[0m[0m endpoint                           = (known after apply)
      [32m+[0m[0m fqdns                              = []
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m kind                               = "OpenAI"
      [32m+[0m[0m local_auth_enabled                 = false
      [32m+[0m[0m location                           = "swedencentral"
      [32m+[0m[0m name                               = "bfr-dev-aoai001"
      [32m+[0m[0m outbound_network_access_restricted = true
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m public_network_access_enabled      = false
      [32m+[0m[0m resource_group_name                = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m sku_name                           = "S0"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_acls {
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-aoai001-account-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-aoai001-account-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-aoai001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.openai.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-aoai001-account-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "account",
            ]
        }
    }

[1m  # module.azure_open_ai.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.bot_service.data.azurerm_application_insights.application_insights[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_application_insights" "application_insights" {
      [32m+[0m[0m app_id              = (known after apply)
      [32m+[0m[0m application_type    = (known after apply)
      [32m+[0m[0m connection_string   = (sensitive value)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m instrumentation_key = (known after apply)
      [32m+[0m[0m location            = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m resource_group_name = (known after apply)
      [32m+[0m[0m retention_in_days   = (known after apply)
      [32m+[0m[0m tags                = (known after apply)
      [32m+[0m[0m workspace_id        = (known after apply)
    }

[1m  # module.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_bot_service_azure_bot" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.bot_service.azurerm_bot_service_azure_bot.bot_service_azure_bot[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bot_service_azure_bot" "bot_service_azure_bot" {
      [32m+[0m[0m developer_app_insights_application_id = (known after apply)
      [32m+[0m[0m developer_app_insights_key            = (known after apply)
      [32m+[0m[0m display_name                          = "Azure Bot Service - Bfr Dev Bot001"
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m icon_url                              = "https://docs.botframework.com/static/devportal/client/images/bot-framework-default.png"
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m local_authentication_enabled          = false
      [32m+[0m[0m location                              = "global"
      [32m+[0m[0m luis_app_ids                          = []
      [32m+[0m[0m microsoft_app_id                      = (known after apply)
      [32m+[0m[0m microsoft_app_msi_id                  = (known after apply)
      [32m+[0m[0m microsoft_app_tenant_id               = (known after apply)
      [32m+[0m[0m microsoft_app_type                    = "UserAssignedMSI"
      [32m+[0m[0m name                                  = "bfr-dev-bot001"
      [32m+[0m[0m public_network_access_enabled         = true
      [32m+[0m[0m resource_group_name                   = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m sku                                   = "S1"
      [32m+[0m[0m streaming_endpoint_enabled            = false
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
    }

[1m  # module.bot_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_bot_service_azure_bot["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_bot_service_azure_bot" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_bot[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "bot_service_azure_bot_private_endpoint_bot" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-bot001-bot-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-bot001-bot-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-bot001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.directline.botframework.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-bot001-bot-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Bot",
            ]
        }
    }

[1m  # module.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_token[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "bot_service_azure_bot_private_endpoint_token" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-bot001-token-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-bot001-token-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-bot001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.token.botframework.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-bot001-token-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Token",
            ]
        }
    }

[1m  # module.bot_service.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cosmosdb_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.cosmosdb_account.azurerm_cosmosdb_account.cosmosdb_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cosmosdb_account" "cosmosdb_account" {
      [32m+[0m[0m access_key_metadata_writes_enabled           = true
      [32m+[0m[0m analytical_storage_enabled                   = false
      [32m+[0m[0m automatic_failover_enabled                   = false
      [32m+[0m[0m burst_capacity_enabled                       = false
      [32m+[0m[0m create_mode                                  = "Default"
      [32m+[0m[0m default_identity_type                        = "FirstPartyIdentity"
      [32m+[0m[0m endpoint                                     = (known after apply)
      [32m+[0m[0m free_tier_enabled                            = false
      [32m+[0m[0m id                                           = (known after apply)
      [32m+[0m[0m is_virtual_network_filter_enabled            = true
      [32m+[0m[0m kind                                         = "GlobalDocumentDB"
      [32m+[0m[0m local_authentication_disabled                = false
      [32m+[0m[0m location                                     = "northeurope"
      [32m+[0m[0m minimal_tls_version                          = "Tls12"
      [32m+[0m[0m mongo_server_version                         = (known after apply)
      [32m+[0m[0m multiple_write_locations_enabled             = false
      [32m+[0m[0m name                                         = "bfr-dev-cosmos001"
      [32m+[0m[0m network_acl_bypass_for_azure_services        = false
      [32m+[0m[0m network_acl_bypass_ids                       = []
      [32m+[0m[0m offer_type                                   = "Standard"
      [32m+[0m[0m partition_merge_enabled                      = false
      [32m+[0m[0m primary_key                                  = (sensitive value)
      [32m+[0m[0m primary_mongodb_connection_string            = (sensitive value)
      [32m+[0m[0m primary_readonly_key                         = (sensitive value)
      [32m+[0m[0m primary_readonly_mongodb_connection_string   = (sensitive value)
      [32m+[0m[0m primary_readonly_sql_connection_string       = (sensitive value)
      [32m+[0m[0m primary_sql_connection_string                = (sensitive value)
      [32m+[0m[0m public_network_access_enabled                = false
      [32m+[0m[0m read_endpoints                               = (known after apply)
      [32m+[0m[0m resource_group_name                          = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m secondary_key                                = (sensitive value)
      [32m+[0m[0m secondary_mongodb_connection_string          = (sensitive value)
      [32m+[0m[0m secondary_readonly_key                       = (sensitive value)
      [32m+[0m[0m secondary_readonly_mongodb_connection_string = (sensitive value)
      [32m+[0m[0m secondary_readonly_sql_connection_string     = (sensitive value)
      [32m+[0m[0m secondary_sql_connection_string              = (sensitive value)
      [32m+[0m[0m tags                                         = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m write_endpoints                              = (known after apply)

      [32m+[0m[0m analytical_storage {
          [32m+[0m[0m schema_type = "FullFidelity"
        }

      [32m+[0m[0m backup {
          [32m+[0m[0m interval_in_minutes = (known after apply)
          [32m+[0m[0m retention_in_hours  = (known after apply)
          [32m+[0m[0m storage_redundancy  = (known after apply)
          [32m+[0m[0m tier                = "Continuous7Days"
          [32m+[0m[0m type                = "Continuous"
        }

      [32m+[0m[0m capabilities (known after apply)

      [32m+[0m[0m capacity {
          [32m+[0m[0m total_throughput_limit = -1
        }

      [32m+[0m[0m consistency_policy {
          [32m+[0m[0m consistency_level = "Strong"
        }

      [32m+[0m[0m geo_location {
          [32m+[0m[0m failover_priority = 0
          [32m+[0m[0m id                = (known after apply)
          [32m+[0m[0m location          = "northeurope"
          [32m+[0m[0m zone_redundant    = false
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.cosmosdb_account.azurerm_private_endpoint.private_endpoint_cosmosdb_account["Sql"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cosmosdb_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-cosmos001-Sql-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-cosmos001-Sql-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-cosmos001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-cosmos001-Sql-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Sql",
            ]
        }
    }

[1m  # module.cosmosdb_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_factory.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_factory.azurerm_data_factory.data_factory[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory" "data_factory" {
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m managed_virtual_network_enabled = true
      [32m+[0m[0m name                            = "bfr-dev-adf001"
      [32m+[0m[0m public_network_enabled          = false
      [32m+[0m[0m resource_group_name             = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_factory.azurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoints["keyvault-vault"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_managed_private_endpoint" "data_factory_managed_private_endpoints" {
      [32m+[0m[0m data_factory_id    = (known after apply)
      [32m+[0m[0m fqdns              = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "keyvault-vault"
      [32m+[0m[0m subresource_name   = "vault"
      [32m+[0m[0m target_resource_id = (known after apply)
    }

[1m  # module.data_factory.azurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoints["storage-blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_managed_private_endpoint" "data_factory_managed_private_endpoints" {
      [32m+[0m[0m data_factory_id    = (known after apply)
      [32m+[0m[0m fqdns              = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "storage-blob"
      [32m+[0m[0m subresource_name   = "blob"
      [32m+[0m[0m target_resource_id = (known after apply)
    }

[1m  # module.data_factory.azurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_data_factory" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_factory.azurerm_private_endpoint.data_factory_private_endpoint_data_factory[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "data_factory_private_endpoint_data_factory" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-adf001-datafactory-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-adf001-datafactory-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-adf001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-adf001-datafactory-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dataFactory",
            ]
        }
    }

[1m  # module.data_factory.null_resource.data_factory_managed_private_endpoint_storage_blob_approval["keyvault-vault"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "data_factory_managed_private_endpoint_storage_blob_approval" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "run_once" = "true"
        }
    }

[1m  # module.data_factory.null_resource.data_factory_managed_private_endpoint_storage_blob_approval["storage-blob"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "data_factory_managed_private_endpoint_storage_blob_approval" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "run_once" = "true"
        }
    }

[1m  # module.data_factory.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.key_vault_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.key_vault_consumption.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "bfr-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.key_vault_consumption.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.key_vault_consumption.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.key_vault_consumption.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "973df2ad-4e5e-4e8b-9df6-17f61e9efd55"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.key_vault_consumption.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.key_vault_ingestion.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.key_vault_ingestion.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "bfr-dev-ngst-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.key_vault_ingestion.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.key_vault_ingestion.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfr-dev-ngst-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfr-dev-ngst-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfr-dev-ngst-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfr-dev-ngst-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.key_vault_ingestion.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "973df2ad-4e5e-4e8b-9df6-17f61e9efd55"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.key_vault_ingestion.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_storage_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "bfrdevstg001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "bfrdevstg001-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "bfrdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "bfrdevstg001-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_storage_blob_data_owner" {
      [32m+[0m[0m description                      = "Required for creating data plane artifacts"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "973df2ad-4e5e-4e8b-9df6-17f61e9efd55"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.storage_account.azurerm_storage_account.storage_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage_account" {
      [32m+[0m[0m access_tier                        = "Hot"
      [32m+[0m[0m account_kind                       = "StorageV2"
      [32m+[0m[0m account_replication_type           = "ZRS"
      [32m+[0m[0m account_tier                       = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public    = false
      [32m+[0m[0m allowed_copy_scope                 = "AAD"
      [32m+[0m[0m cross_tenant_replication_enabled   = false
      [32m+[0m[0m default_to_oauth_authentication    = true
      [32m+[0m[0m dns_endpoint_type                  = "Standard"
      [32m+[0m[0m https_traffic_only_enabled         = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled  = true
      [32m+[0m[0m is_hns_enabled                     = false
      [32m+[0m[0m large_file_share_enabled           = false
      [32m+[0m[0m local_user_enabled                 = true
      [32m+[0m[0m location                           = "northeurope"
      [32m+[0m[0m min_tls_version                    = "TLS1_2"
      [32m+[0m[0m name                               = "bfrdevstg001"
      [32m+[0m[0m nfsv3_enabled                      = false
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string     = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint              = (known after apply)
      [32m+[0m[0m primary_blob_host                  = (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_connection_string          = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint               = (known after apply)
      [32m+[0m[0m primary_dfs_host                   = (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [32m+[0m[0m primary_file_endpoint              = (known after apply)
      [32m+[0m[0m primary_file_host                  = (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_location                   = (known after apply)
      [32m+[0m[0m primary_queue_endpoint             = (known after apply)
      [32m+[0m[0m primary_queue_host                 = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_table_endpoint             = (known after apply)
      [32m+[0m[0m primary_table_host                 = (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_web_endpoint               = (known after apply)
      [32m+[0m[0m primary_web_host                   = (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [32m+[0m[0m public_network_access_enabled      = true
      [32m+[0m[0m queue_encryption_key_type          = "Account"
      [32m+[0m[0m resource_group_name                = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
      [32m+[0m[0m sftp_enabled                       = false
      [32m+[0m[0m shared_access_key_enabled          = false
      [32m+[0m[0m table_encryption_key_type          = "Account"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }

      [32m+[0m[0m blob_properties {
          [32m+[0m[0m change_feed_enabled      = false
          [32m+[0m[0m default_service_version  = (known after apply)
          [32m+[0m[0m last_access_time_enabled = false
          [32m+[0m[0m versioning_enabled       = false

          [32m+[0m[0m container_delete_retention_policy {
              [32m+[0m[0m days = 7
            }

          [32m+[0m[0m delete_retention_policy {
              [32m+[0m[0m days                     = 7
              [32m+[0m[0m permanent_delete_enabled = false
            }
        }

      [32m+[0m[0m network_rules {
          [32m+[0m[0m bypass                     = [
              [32m+[0m[0m "None",
            ]
          [32m+[0m[0m default_action             = "Deny"
          [32m+[0m[0m ip_rules                   = (known after apply)
          [32m+[0m[0m virtual_network_subnet_ids = (known after apply)

          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner"
              [32m+[0m[0m endpoint_tenant_id   = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
            }
          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/*/providers/Microsoft.CognitiveServices/accounts/*"
              [32m+[0m[0m endpoint_tenant_id   = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
            }
        }

      [32m+[0m[0m queue_properties (known after apply)

      [32m+[0m[0m routing {
          [32m+[0m[0m choice                      = "MicrosoftRouting"
          [32m+[0m[0m publish_internet_endpoints  = false
          [32m+[0m[0m publish_microsoft_endpoints = false
        }

      [32m+[0m[0m sas_policy {
          [32m+[0m[0m expiration_action = "Log"
          [32m+[0m[0m expiration_period = "1.00:00:00"
        }

      [32m+[0m[0m share_properties (known after apply)
    }

[1m  # module.storage_account.azurerm_storage_container.storage_container["curated"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "curated"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "bfrdevstg001"
    }

[1m  # module.storage_account.azurerm_storage_container.storage_container["raw"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "raw"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "bfrdevstg001"
    }

[1m  # module.storage_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.user_assigned_identity_consumption.azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "bfr-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "bfr-dev-bot-cnsm-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1m  # module.user_assigned_identity_ingestion.azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "bfr-dev-ngst-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "bfr-dev-bot-ngst-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "workload" = "bot-assistant"
        }
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1mPlan:[0m 63 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>